In [1]:
from numpy import sum,array

In [2]:
sum(array([1,2,3,4,5,6,7,8,9]))

45

## @ pandas

In [3]:
import pandas as pd

In [4]:
pd.__version__

'1.1.3'

In [5]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [6]:
print(len(dir(pd)))

140

## pandas series

In [7]:
import pandas as pd
import numpy as np

In [8]:
mydata=np.arange(30,50,5)
print(mydata)

[30 35 40 45]

In [10]:
r=pd.Series(np.array([1,2,3,4,5]))
print(r)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [11]:
r=pd.Series(np.array([1,2,3,4,5]),index=['a','b','c','d','e'])

In [12]:
r

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [14]:
r=pd.Series(np.array(["value",2,3,4,5]),index=['index',1,2,3,4])
r

index    value
1            2
2            3
3            4
4            5
dtype: object

In [15]:
help(np)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [16]:
r=pd.Series(np.array([1,2,3,4,5]),index=['a','b','c','d','e'],name='roll number')

In [17]:
r

a    1
b    2
c    3
d    4
e    5
Name: roll number, dtype: int32

In [18]:
r=pd.Series(np.array([1,2,3,4,5]),index=['a','b','c','d','e'],dtype='float')

In [19]:
r

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float64

In [21]:
d={'a':111,'b':396,'c':53}
d

{'a': 111, 'b': 396, 'c': 53}

In [22]:
d.keys()

dict_keys(['a', 'b', 'c'])

In [23]:
d.items()

dict_items([('a', 111), ('b', 396), ('c', 53)])

In [25]:
marks=pd.Series(d)
print(marks)

a    111
b    396
c     53
dtype: int64

In [26]:
marks=pd.Series(d,name='marks',dtype='str')
print(marks)

a    111
b    396
c     53
Name: marks, dtype: object

In [27]:
marks[2]

'53'

In [28]:
marks[0:2]

a    111
b    396
Name: marks, dtype: object

In [29]:
marks['c']

'53'

In [31]:
marks[['a','b']]

a    111
b    396
Name: marks, dtype: object

## iloc

## loc

In [32]:
marks.iloc[0]

'111'

In [33]:
marks.loc['a']

'111'

In [34]:
marks.loc['a':]

a    111
b    396
c     53
Name: marks, dtype: object

## random values

In [37]:
import random

In [39]:
random.randint(1,100)

26

In [41]:
x=random.randint(1,100)
y=random.randint(1,100)
print(x,y)

100 14

## operators

In [42]:
b=pd.Series(np.array([1,2,3,4,5]),index=list('abcde'),name='grades')
b

a    1
b    2
c    3
d    4
e    5
Name: grades, dtype: int32

In [44]:
for i in b.keys():
    if b[i]>3:
        print(b[i])

4
5

In [45]:
b[b>3]

d    4
e    5
Name: grades, dtype: int32

In [46]:
b.mean()

3.0

In [47]:
b['a':'d'].mean()

2.5

In [49]:
b.std()

1.5811388300841898

In [50]:
b.var()

2.5

In [51]:
b['b']=12

In [52]:
b

a     1
b    12
c     3
d     4
e     5
Name: grades, dtype: int32

## dataframes

In [53]:
ms_marks={'sub1':[99,98,78,99,56],'sub2':[67,78,88,99,59],'sub3':[22,44,77,99,100]}

In [54]:
ms_marks

{'sub1': [99, 98, 78, 99, 56],
 'sub2': [67, 78, 88, 99, 59],
 'sub3': [22, 44, 77, 99, 100]}

In [58]:
marks=pd.DataFrame(ms_marks,index=['yasaswini😜','hachitha😉','bhachi😁','varcha😮','hehe🤗'])
marks

            sub1  sub2  sub3
yasaswini😜    99    67    22
hachitha😉     98    78    44
bhachi😁       78    88    77
varcha😮       99    99    99
hehe🤗         56    59   100

In [60]:
marks.loc['bhachi😁']

sub1    78
sub2    88
sub3    77
Name: bhachi😁, dtype: int64

In [63]:
marks.loc[['bhachi😁','hachitha😉']]

           sub1  sub2  sub3
bhachi😁      78    88    77
hachitha😉    98    78    44

In [64]:
marks.loc['bhachi😁'].sum()

243

In [66]:
marks.index

Index(['yasaswini😜', 'hachitha😉', 'bhachi😁', 'varcha😮', 'hehe🤗'], dtype='object')

In [69]:
marks.columns

Index(['sub1', 'sub2', 'sub3'], dtype='object')

In [75]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, yasaswini😜 to hehe🤗
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sub1    5 non-null      int64
 1   sub2    5 non-null      int64
 2   sub3    5 non-null      int64
dtypes: int64(3)
memory usage: 320.0+ bytes

In [71]:
marks.size

15

In [72]:
marks.shape

(5, 3)

In [76]:
marks.describe()

            sub1       sub2        sub3
count   5.000000   5.000000    5.000000
mean   86.000000  78.200000   68.400000
std    19.013153  15.990622   34.486229
min    56.000000  59.000000   22.000000
25%    78.000000  67.000000   44.000000
50%    98.000000  78.000000   77.000000
75%    99.000000  88.000000   99.000000
max    99.000000  99.000000  100.000000

In [77]:
marks.sub1

yasaswini😜    99
hachitha😉     98
bhachi😁       78
varcha😮       99
hehe🤗         56
Name: sub1, dtype: int64

In [78]:
marks['sub1']

yasaswini😜    99
hachitha😉     98
bhachi😁       78
varcha😮       99
hehe🤗         56
Name: sub1, dtype: int64

In [79]:
marks[['sub1','sub3']]

            sub1  sub3
yasaswini😜    99    22
hachitha😉     98    44
bhachi😁       78    77
varcha😮       99    99
hehe🤗         56   100

In [82]:
marks[['sub1','sub2','sub3']]

            sub1  sub2  sub3
yasaswini😜    99    67    22
hachitha😉     98    78    44
bhachi😁       78    88    77
varcha😮       99    99    99
hehe🤗         56    59   100

In [87]:
marks[marks>70].index

Index(['yasaswini😜', 'hachitha😉', 'bhachi😁', 'varcha😮', 'hehe🤗'], dtype='object')

In [88]:
marks[marks>70]

            sub1  sub2   sub3
yasaswini😜  99.0   NaN    NaN
hachitha😉   98.0  78.0    NaN
bhachi😁     78.0  88.0   77.0
varcha😮     99.0  99.0   99.0
hehe🤗        NaN   NaN  100.0

In [89]:
marks.sub1['hachitha😉']

98

In [90]:
marks.iloc[0][1:]

sub2    67
sub3    22
Name: yasaswini😜, dtype: int64

In [91]:
marks.iloc[3][0:]

sub1    99
sub2    99
sub3    99
Name: varcha😮, dtype: int64

In [92]:
marks.iloc[3][0]

99

In [94]:
marks.iloc[2][0:2]

sub1    78
sub2    88
Name: bhachi😁, dtype: int64

In [97]:
marks.iloc[4][2]

100

## adding coloumns

In [98]:
marks['sub4']=[36,56,89,56,25]

In [99]:
marks

            sub1  sub2  sub3  sub4
yasaswini😜    99    67    22    36
hachitha😉     98    78    44    56
bhachi😁       78    88    77    89
varcha😮       99    99    99    56
hehe🤗         56    59   100    25

# row and column drop

In [100]:
marks.drop(columns='sub4')

            sub1  sub2  sub3
yasaswini😜    99    67    22
hachitha😉     98    78    44
bhachi😁       78    88    77
varcha😮       99    99    99
hehe🤗         56    59   100

In [104]:
marks.drop(columns='sub3',axis=1)

            sub1  sub2  sub4
yasaswini😜    99    67    36
hachitha😉     98    78    56
bhachi😁       78    88    89
varcha😮       99    99    56
hehe🤗         56    59    25

In [105]:
marks

            sub1  sub2  sub3  sub4
yasaswini😜    99    67    22    36
hachitha😉     98    78    44    56
bhachi😁       78    88    77    89
varcha😮       99    99    99    56
hehe🤗         56    59   100    25

In [106]:
marks.drop(columns='sub3',axis=0)

            sub1  sub2  sub4
yasaswini😜    99    67    36
hachitha😉     98    78    56
bhachi😁       78    88    89
varcha😮       99    99    56
hehe🤗         56    59    25

In [107]:
marks

            sub1  sub2  sub3  sub4
yasaswini😜    99    67    22    36
hachitha😉     98    78    44    56
bhachi😁       78    88    77    89
varcha😮       99    99    99    56
hehe🤗         56    59   100    25

In [109]:
marks.drop(columns='sub3',axis=1,inplace=True)

In [110]:
marks

            sub1  sub2  sub4
yasaswini😜    99    67    36
hachitha😉     98    78    56
bhachi😁       78    88    89
varcha😮       99    99    56
hehe🤗         56    59    25

In [112]:
marks.drop('hehe🤗',inplace=True)
marks

            sub1  sub2  sub4
yasaswini😜    99    67    36
hachitha😉     98    78    56
bhachi😁       78    88    89
varcha😮       99    99    56

## update marks

In [115]:
marks.iloc[2][1]=80

In [116]:
marks

            sub1  sub2  sub4
yasaswini😜    99    67    36
hachitha😉     98    78    56
bhachi😁       78    80    89
varcha😮       99    99    56

In [119]:
marks.sub4=100

In [120]:
marks

            sub1  sub2  sub4
yasaswini😜    99    67   100
hachitha😉     98    78   100
bhachi😁       78    80   100
varcha😮       99    99   100

## csv file access

In [127]:
data=pd.read_csv('population.csv')
data

   2001   2002  2003   2004  2005  2006   2007  2008😋
0    91   91.5    90   92.0  90.3    90   90.8   90.7
1   120  121.0   121  120.3  12.4   122  124.0  120.0
2    86   85.0    84   82.0  89.0    87   80.0   85.5
3    91   91.5    90   92.0  90.3    90   90.8   90.7
4   120  121.0   121  120.3  12.4   122  124.0  120.0
5    86   85.0    84   82.0  89.0    87   80.0   85.5

In [129]:
data.shape

(6, 8)

In [130]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   2001    6 non-null      int64
 1   2002    6 non-null      float64
 2   2003    6 non-null      int64
 3   2004    6 non-null      float64
 4   2005    6 non-null      float64
 5   2006    6 non-null      int64
 6   2007    6 non-null      float64
 7   2008😋   6 non-null      float64
dtypes: float64(5), int64(3)
memory usage: 512.0 bytes

In [131]:
data.size

48

In [132]:
data.columns

Index(['2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008😋'], dtype='object')

In [133]:
data

   2001   2002  2003   2004  2005  2006   2007  2008😋
0    91   91.5    90   92.0  90.3    90   90.8   90.7
1   120  121.0   121  120.3  12.4   122  124.0  120.0
2    86   85.0    84   82.0  89.0    87   80.0   85.5
3    91   91.5    90   92.0  90.3    90   90.8   90.7
4   120  121.0   121  120.3  12.4   122  124.0  120.0
5    86   85.0    84   82.0  89.0    87   80.0   85.5

In [139]:
data.index=['india','china','england','australia','south korea','north korea🏴‍☠️']

In [140]:
data

                 2001   2002  2003   2004  2005  2006   2007  2008😋
india              91   91.5    90   92.0  90.3    90   90.8   90.7
china             120  121.0   121  120.3  12.4   122  124.0  120.0
england            86   85.0    84   82.0  89.0    87   80.0   85.5
australia          91   91.5    90   92.0  90.3    90   90.8   90.7
south korea       120  121.0   121  120.3  12.4   122  124.0  120.0
north korea🏴‍☠️    86   85.0    84   82.0  89.0    87   80.0   85.5

In [141]:
cse=pd.read_excel('cse.xlsx')

In [142]:
cse

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,ms,mad,sa,spm,gcc,is
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,501.0,85,92,77,84,93,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,502.0,82,98,89,78,92,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,503.0,83,85,55,75,90,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,504.0,85,87,78,76,89,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,505.0,87,89,79,79,87,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,506.0,88,99,84,55,82,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,507.0,89,92,85,69,85,NaN